[
    {
        "id": "ami",
        "name": "ami",
        "github_url": "https://app.ami.dev",
        "script_text": "ami is a Web-based project that the fastest coding agent for frontend. This project focuses on website, providing developers with specialized tools and capabilities in these areas. Built with Web, it leverages the language's strengths to deliver robust performance. Developers can integrate ami into their workflows to improve their testing strategies and code quality. Check out ami if you're working in this space."
    },
    {
        "id": "cloudflare_moltworker",
        "name": "moltworker",
        "github_url": "https://github.com/cloudflare/moltworker",
        "script_text": "moltworker is a TypeScript-based project that run openclaw, (formerly moltbot, formerly clawdbot) on cloudflare workers. Experimental This is a proof of concept demonstrating that OpenClaw can run in Cloudflare Sandbox. It is not officially supported and may break without notice. Use at your own risk. The following Cloudflare features used by this project have free tiers Cloudflare Access (authentication) Browser This project focuses on ai-agents, cloudflare-workers, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate moltworker into their workflows to solve complex technical challenges more efficiently. moltworker is worth exploring for your next project."
    },
    {
        "id": "aryankashyap0_shorlabs",
        "name": "shorlabs",
        "github_url": "https://github.com/aryankashyap0/shorlabs",
        "script_text": "shorlabs is a TypeScript-based project that open source full-stack deployment platform. Ship Software in Peace. Shorlabs gives you the tools and infrastructure to deploy, scale, and manage your frontend and backend apps from one place. Connect a GitHub repository and deploy in one flow. Detect framework runtime and suggest a start command automatically. Deploy with configurable memory, Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate shorlabs into their workflows to streamline their deployment and infrastructure management. Check out shorlabs if you're working in this space."
    },
    {
        "id": "gboeing_osmnx",
        "name": "osmnx",
        "github_url": "https://github.com/gboeing/osmnx",
        "script_text": "osmnx is a Python-based project that download, model, analyze, and visualize street networks and other geospatial features from openstreetmap.. OSMnx is a Python package to easily download, model, analyze, and visualize street networks and other geospatial features from OpenStreetMap. You can download and model walking, driving, or biking networks with a single line of code then analyze and visualize them. You can just as easily work with u This project focuses on geography, geospatial, gis, mapping, networks, providing developers with specialized tools and capabilities in these areas. Built with Python, it leverages the language's strengths to deliver robust performance. Developers can integrate osmnx into their workflows to solve complex technical challenges more efficiently. osmnx is worth exploring for your next project."
    },
    {
        "id": "asg017_sqlite_dist",
        "name": "sqlite-dist",
        "github_url": "https://github.com/asg017/sqlite-dist",
        "script_text": "sqlite-dist is a Rust-based project an open-source tool available on GitHub. A CLI tool for packing and distributing pre-compiled SQLite extensions. Can be used to distribute SQLite extensions on Github releases for general use Work-in-progress, not complete yet! Watch this repo for updates. Built with Rust, it leverages the language's strengths to deliver robust performance. Developers can integrate sqlite-dist into their workflows to solve complex technical challenges more efficiently. Check out sqlite-dist if you're working in this space."
    },
    {
        "id": "oleg_agapov_tablediff",
        "name": "tablediff",
        "github_url": "https://github.com/oleg-agapov/tablediff",
        "script_text": "tablediff is a Python-based project that cli tool for data diffing between two tables. CLI tool for data diffing between two tables The package is available in PyPi and can be installed by specifying the package name and the adapter for your database. Adapter Command ------------ ----------------------------------------------- DuckDB Built with Python, it leverages the language's strengths to deliver robust performance. Developers can integrate tablediff into their workflows to manage and process data more effectively. Check out tablediff if you're working in this space."
    },
    {
        "id": "adversis_tailsnitch",
        "name": "tailsnitch",
        "github_url": "https://github.com/Adversis/tailsnitch",
        "script_text": "tailsnitch is a Go-based project that a security auditor for tailscale configurations. scans your tailnet for misconfigurations, overly permissive access controls, and security best practice violations.. A security auditor for Tailscale configurations. Tailsnitch scans your tailnet for 50 misconfigurations, overly permissive access controls, and security best practice violations. export TSKEY \"tskey-api-...\" tailsnitch --severity high tailsnitch --fix macOS users Remove quarantine attribute after Built with Go, it leverages the language's strengths to deliver robust performance. Developers can integrate tailsnitch into their workflows to solve complex technical challenges more efficiently. Check out tailsnitch if you're working in this space."
    },
    {
        "id": "gibbok_typescript_book",
        "name": "typescript-book",
        "github_url": "https://github.com/gibbok/typescript-book",
        "script_text": "typescript-book is a Python-based project that the concise typescript book a concise guide to effective development in typescript. free and open source.. The Concise TypeScript Book provides a comprehensive and succinct overview of TypeScript's capabilities. It offers clear explanations covering all aspects found in the latest version of the language, from its powerful type system to advanced features. Whether you're a beginner or an experienced deve This project focuses on book, free, javascript, javascript-book, learn-typescript, providing developers with specialized tools and capabilities in these areas. Built with Python, it leverages the language's strengths to deliver robust performance. Developers can integrate typescript-book into their workflows to solve complex technical challenges more efficiently. typescript-book is worth exploring for your next project."
    },
    {
        "id": "pranshuparmar_witr",
        "name": "witr",
        "github_url": "https://github.com/pranshuparmar/witr",
        "script_text": "witr is a Go-based project that why is this running?. Purpose Installation Flags Examples Platforms Goals Core Concept Output Behavior Success Criteria witr exists to answer a single question Why is this running? When something is running on a system, whether it is a process, a service, or something bound to a port, there is always a c Built with Go, it leverages the language's strengths to deliver robust performance. Developers can integrate witr into their workflows to solve complex technical challenges more efficiently. witr is worth exploring for your next project."
    },
    {
        "id": "agrinman_tunnelto",
        "name": "tunnelto",
        "github_url": "https://github.com/agrinman/tunnelto",
        "script_text": "tunnelto is a Rust-based project that expose your local web server to the internet with a public url.. tunnelto lets you expose your locally running web server via a public URL. Written in Rust. Built completely with async-io on top of tokio. 2. Usage Instructions 3. Host it yourself brew install agrinman tap tunnelto cargo install tunnelto shell script tunnelto --port 8000 The above command opens This project focuses on async-io, expose, localhost, rust, tunnel, providing developers with specialized tools and capabilities in these areas. Built with Rust, it leverages the language's strengths to deliver robust performance. Developers can integrate tunnelto into their workflows to solve complex technical challenges more efficiently. tunnelto is worth exploring for your next project."
    },
    {
        "id": "huseyinbabal_taws",
        "name": "taws",
        "github_url": "https://github.com/huseyinbabal/taws",
        "script_text": "taws is a Rust-based project that terminal ui for aws (taws) - a terminal-based aws resource viewer and manager. taws provides a terminal UI to interact with your AWS resources. The aim of this project is to make it easier to navigate, observe, and manage your AWS infrastructure in the wild. Multi-Profile Support - Easily switch between AWS profiles Multi-Region Support - Navigate across different AWS regions Built with Rust, it leverages the language's strengths to deliver robust performance. Developers can integrate taws into their workflows to solve complex technical challenges more efficiently. Check out taws if you're working in this space."
    },
    {
        "id": "aidenybai_react_grab",
        "name": "react-grab",
        "github_url": "https://github.com/aidenybai/react-grab",
        "script_text": "react-grab is a TypeScript-based project that select context for coding agents directly from your website. Select context for coding agents directly from your website How? Point at any element and press C (Mac) or Ctrl C (Windows Linux) to copy the file name, React component, and HTML source code. Run this command at your project root (where next.config.ts or vite.config.ts is located) npx -y grab late This project focuses on ai, coding, react, react-grab, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate react-grab into their workflows to solve complex technical challenges more efficiently. react-grab is worth exploring for your next project."
    },
    {
        "id": "c3",
        "name": "C3",
        "github_url": "https://c3-lang.org",
        "script_text": "C3 is a Web-based project that c3 is a programming language that builds on the syntax and semantics of the c language, with the goal of evolving it while still retaining familiarity for c programmers.. This project focuses on website, providing developers with specialized tools and capabilities in these areas. Built with Web, it leverages the language's strengths to deliver robust performance. Developers can integrate C3 into their workflows to solve complex technical challenges more efficiently. Check out C3 if you're working in this space."
    },
    {
        "id": "badlogic_pi_mono",
        "name": "pi-mono",
        "github_url": "https://github.com/badlogic/pi-mono",
        "script_text": "pi-mono is a TypeScript-based project that ai agent toolkit coding agent cli, unified llm api, tui web ui libraries, slack bot, vllm pods. Issue tracker and PRs reopen February 23, 2026. Looking for the pi coding agent? See packages coding-agent for installation and usage. Tools for building AI agents and managing LLM deployments. Package Description --------- ------------- mariozechner pi-ai Unified multi-provider LLM A Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate pi-mono into their workflows to build robust APIs and backend services. pi-mono is worth exploring for your next project."
    },
    {
        "id": "marcoaapfortes_mantic.sh",
        "name": "Mantic.sh",
        "github_url": "https://github.com/marcoaapfortes/Mantic.sh",
        "script_text": "Mantic.sh is a TypeScript-based project that a structural code search engine for al agents.. Mantic is a context-aware code search engine that prioritizes relevance over raw speed. After testing across 5 repositories (cal.com, next.js, tensorflow, supabase, chromium), it demonstrates superior result quality compared to grep ripgrep, despite some trade-offs in speed for very large codebases. This project focuses on ai-agent, claude, code-search, context-retrieval, cursor, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate Mantic.sh into their workflows to solve complex technical challenges more efficiently. Check out Mantic.sh if you're working in this space."
    }
]