[
  {
    "id": "sqlxpert_lights_off_aws",
    "name": "lights-off-aws",
    "github_url": "https://github.com/sqlxpert/lights-off-aws",
    "script_text": "lights-off-aws is a HCL-based project that stop ec2 instances and rds aurora databases overnight by tagging them with cron schedules, to cut aws costs. trigger cloudformation stack updates and aws backup, too.. Ever forget to turn the lights off? Now you can Stop EC2 instances and RDS Aurora databases temporarily by tagging them with cron schedules, to cut AWS costs. Schedules (not references to schedules) go directly in the tags. Trigger AWS Backup with cron schedules in resource tags. Delete expensive i This project focuses on aurora, aws, aws-backup, aws-cost, aws-lambda, providing developers with specialized tools and capabilities in these areas. Built with HCL, it leverages the language's strengths to deliver robust performance. Developers can integrate lights-off-aws into their workflows to manage and process data more effectively. Check out lights-off-aws if you're working in this space."
  },
  {
    "id": "platform_engineering_labs_formae",
    "name": "formae",
    "github_url": "https://github.com/platform-engineering-labs/formae",
    "script_text": "formae is a Go-based project that infrastructure-as-code platform built for the future. formae is a 100 code-based, agentic IaC (Infrastructure-as-Code) tool built from scratch for the modern age. We believe that code is the only medium every engineer on every level understands and wants. So formae implements infrastructure entirely as code - in and out, and in any granularity. formae This project focuses on devops, iac, infrastructure-as-code, platform-engineering, sre, providing developers with specialized tools and capabilities in these areas. Built with Go, it leverages the language's strengths to deliver robust performance. Developers can integrate formae into their workflows to solve complex technical challenges more efficiently. Check out formae if you're working in this space."
  },
  {
    "id": "angular_web_codegen_scorer",
    "name": "web-codegen-scorer",
    "github_url": "https://github.com/angular/web-codegen-scorer",
    "script_text": "web-codegen-scorer is a TypeScript-based project that web codegen scorer is a tool for evaluating the quality of web code generated by llms.. Web Codegen Scorer is a tool for evaluating the quality of web code generated by Large Language Models (LLMs). You can use this tool to make evidence-based decisions relating to AI-generated code. For example Iterate on a system prompt to find most effective instructions for your project. Comp This project focuses on benchmarking, codegen, evaluation, llm-coding, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate web-codegen-scorer into their workflows to solve complex technical challenges more efficiently. Check out web-codegen-scorer if you're working in this space."
  },
  {
    "id": "google_coral_coralnpu",
    "name": "coralnpu",
    "github_url": "https://github.com/google-coral/coralnpu",
    "script_text": "coralnpu is a Emacs Lisp-based project that a machine learning accelerator core designed for energy-efficient ai at the edge.. Coral NPU is a hardware accelerator for ML inferencing. Coral NPU is an Open Source IP designed by Google Research and is freely available for integration into ultra-low-power System-on-Chips (SoCs) targeting wearable devices such as hearables, augmented reality (AR) glasses and smart watches. Coral Built with Emacs Lisp, it leverages the language's strengths to deliver robust performance. Developers can integrate coralnpu into their workflows to solve complex technical challenges more efficiently. Check out coralnpu if you're working in this space."
  },
  {
    "id": "mountain_loop_yaak",
    "name": "yaak",
    "github_url": "https://github.com/mountain-loop/yaak",
    "script_text": "yaak is a TypeScript-based project that the most intuitive desktop api client. organize and execute rest, graphql, websockets, server sent events, and grpc . Yaak Desktop API Client A fast, privacy-first API client for REST, GraphQL, SSE, WebSocket, and gRPC built with Tauri, Rust, and React. This project focuses on bruno-alternative, graphql, grpc, http, http-client, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate yaak into their workflows to build robust APIs and backend services. yaak is worth exploring for your next project."
  },
  {
    "id": "rohanadwankar_oxdraw",
    "name": "oxdraw",
    "github_url": "https://github.com/RohanAdwankar/oxdraw",
    "script_text": "oxdraw is a Rust-based project that diagram as code tool written in rust with draggable editing. The goal of oxdraw is to make it easy to create and maintain high-quality diagrams using a declarative and reproducible syntax. Aside from the normal diagrams, oxdraw can also embed images directly into the diagrams and view codemaps of codebase where nodes are linked to codesegments. The changes ar Built with Rust, it leverages the language's strengths to deliver robust performance. Developers can integrate oxdraw into their workflows to solve complex technical challenges more efficiently. Check out oxdraw if you're working in this space."
  },
  {
    "id": "basecamp_omarchy",
    "name": "omarchy",
    "github_url": "https://github.com/basecamp/omarchy",
    "script_text": "omarchy is a Shell-based project that beautiful, modern opinionated linux. Omarchy is a beautiful, modern opinionated Linux distribution by DHH. Built with Shell, it leverages the language's strengths to deliver robust performance. Developers can integrate omarchy into their workflows to solve complex technical challenges more efficiently. omarchy is worth exploring for your next project."
  },
  {
    "id": "truffle_ai_dexto",
    "name": "dexto",
    "github_url": "https://github.com/truffle-ai/dexto",
    "script_text": "dexto is a TypeScript-based project that dexto is a general-purpose agent harness for building and orchestrating agentic applications.. An all-in-one toolkit to build agentic applications that turn natural language into real-world actions. Dexto is a universal intelligence layer for building collaborative, context-aware AI Agents agentic apps. It orchestrates LLMs, tools, and data into persistent, stateful systems with memory, so This project focuses on ai, ai-agent, ai-agents, ai-tools, contributions-welcome, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate dexto into their workflows to solve complex technical challenges more efficiently. Check out dexto if you're working in this space."
  },
  {
    "id": "mathiasbynens_emoji_regex",
    "name": "emoji-regex",
    "github_url": "https://github.com/mathiasbynens/emoji-regex",
    "script_text": "emoji-regex is a JavaScript-based project that a regular expression to match all emoji-only symbols as per the unicode standard.. npm install emoji-regex const emojiRegex require('emoji-regex') Note because the regular expression has the global flag set, this module exports a function that returns the regex rather than exporting the regular expression itself, to make it impossible to (accidentally) mutate the o This project focuses on emoji, regex, regexp, regular-expression, unicode, providing developers with specialized tools and capabilities in these areas. Built with JavaScript, it leverages the language's strengths to deliver robust performance. Developers can integrate emoji-regex into their workflows to solve complex technical challenges more efficiently. Check out emoji-regex if you're working in this space."
  }
]