[
    {
        "id": "thedotmack_claude_mem",
        "name": "claude-mem",
        "github_url": "https://github.com/thedotmack/claude-mem",
        "script_text": "claude-mem is a TypeScript-based project that a claude code plugin that automatically captures everything claude does during your coding sessions, compresses it with ai (using claude's agent-sdk), and injects relevant context back into future sessions.. This project focuses on ai, ai-agents, ai-memory, anthropic, artificial-intelligence, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate claude-mem into their workflows to solve complex technical challenges more efficiently. claude-mem is worth exploring for your next project."
    },
    {
        "id": "steveyegge_beads",
        "name": "beads",
        "github_url": "https://github.com/steveyegge/beads",
        "script_text": "beads is a Go-based project that beads - a memory upgrade for your coding agent. Distributed, git-backed graph issue tracker for AI agents. Platforms macOS, Linux, Windows, FreeBSD Beads provides a persistent, structured memory for coding agents. It replaces messy markdown plans with a dependency-aware graph, allowing agents to handle long-horizon tasks without losing context. This project focuses on agents, claude-code, coding, providing developers with specialized tools and capabilities in these areas. Built with Go, it leverages the language's strengths to deliver robust performance. Developers can integrate beads into their workflows to solve complex technical challenges more efficiently. beads is worth exploring for your next project."
    },
    {
        "id": "kubernetes_sigs_headlamp",
        "name": "headlamp",
        "github_url": "https://github.com/kubernetes-sigs/headlamp",
        "script_text": "headlamp is a TypeScript-based project that a kubernetes web ui that is fully-featured, user-friendly and extensible. Headlamp is an easy-to-use and extensible Kubernetes web UI. Headlamp was created to blend the traditional feature set of other web UIs dashboards (i.e., to list and view resources) with added functionality. Vendor-independent generic Kubernetes UI Works in-cluster, or locally as a desktop app Mul This project focuses on cloud-native, dashboard, debugging, devops, headlamp, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate headlamp into their workflows to solve complex technical challenges more efficiently. headlamp is worth exploring for your next project."
    },
    {
        "id": "dayuanjiang_next_ai_draw_io",
        "name": "next-ai-draw-io",
        "github_url": "https://github.com/DayuanJiang/next-ai-draw-io",
        "script_text": "next-ai-draw-io is a TypeScript-based project that a next.js web application that integrates ai capabilities with draw.io diagrams. this app allows you to create, modify, and enhance diagrams through natural language commands and ai-assisted visualization.. AI-Powered Diagram Creation Tool - Chat, Draw, Visualize English A Next.js web application that integrates AI capabilities with draw.io diagrams. Create, modify, and enhance diagrams through natural language commands and AI-assisted visualization. https github.com user-attachments asset This project focuses on ai, diagrams, productivity, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate next-ai-draw-io into their workflows to solve complex technical challenges more efficiently. next-ai-draw-io is worth exploring for your next project."
    },
    {
        "id": "c4illin_convertx",
        "name": "ConvertX",
        "github_url": "https://github.com/C4illin/ConvertX",
        "script_text": "ConvertX is a TypeScript-based project that Self-hosted online file converter. Supports 1000 formats . A self-hosted online file converter. Supports over a thousand different formats. Written with TypeScript, Bun and Elysia. Convert files to different formats Process multiple files at once Password protection Multiple accounts Converter Use ca This project focuses on bun, conversion, convert, converter, document-conversion, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate ConvertX into their workflows to solve complex technical challenges more efficiently. ConvertX is worth exploring for your next project."
    },
    {
        "id": "njbrake_agent_of_empires",
        "name": "agent-of-empires",
        "github_url": "https://github.com/njbrake/agent-of-empires",
        "script_text": "agent-of-empires is a Rust-based project that claude code, opencode, mistral vibe, codex cli coding agent terminal session manager via tmux and git worktrees. A coding agent and shell terminal session manager for Linux and macOS using tmux to aid in management and monitoring of AI coding agents, written in Rust. Git worktree management for easily handling parallel agents in one codebase Easily sandbox your agents in docker containers Quickly toggle betwee This project focuses on ai-coding, claude, claude-code, cli, codex, providing developers with specialized tools and capabilities in these areas. Built with Rust, it leverages the language's strengths to deliver robust performance. Developers can integrate agent-of-empires into their workflows to solve complex technical challenges more efficiently. Check out agent-of-empires if you're working in this space."
    },
    {
        "id": "tencent_weknora",
        "name": "WeKnora",
        "github_url": "https://github.com/Tencent/WeKnora",
        "script_text": "WeKnora is a Go-based project that llm-powered framework for deep document understanding, semantic retrieval, and context-aware answers using rag paradigm.. Overview Architecture Key Features Getting Started API Reference Developer Guide It adopts a modular architecture that combines multimodal preprocessing, semantic vector indexing, intelligent retrieval, and large language model inference. At its core, WeKnora follows the RAG (Retrieval-Aug This project focuses on agent, agentic, ai, chatbot, chatbots, providing developers with specialized tools and capabilities in these areas. Built with Go, it leverages the language's strengths to deliver robust performance. Developers can integrate WeKnora into their workflows to solve complex technical challenges more efficiently. WeKnora is worth exploring for your next project."
    },
    {
        "id": "sinelaw_fresh",
        "name": "fresh",
        "github_url": "https://github.com/sinelaw/fresh",
        "script_text": "fresh is a Rust-based project that text editor for your terminal easy, powerful and fast. Installation Instructions Contributing Why another text editor? Fresh brings the intuitive, conventional UX of editors like VS Code and Sublime Text to the terminal. While veterans like Emacs and Vim - and newer editors like Neovim and Helix - are excellent for power users who prefer modal, highly Built with Rust, it leverages the language's strengths to deliver robust performance. Developers can integrate fresh into their workflows to solve complex technical challenges more efficiently. fresh is worth exploring for your next project."
    },
    {
        "id": "swark_io_swark",
        "name": "swark",
        "github_url": "https://github.com/swark-io/swark",
        "script_text": "swark is a TypeScript-based project that create architecture diagrams from code automatically using large language models (llms).. Free Open Source Powered by LLMs Swark is a VS Code extension that allows creating architecture diagrams from code automatically using large language models (LLMs). Swark is directly integrated with GitHub Copilot, and requires no authentication or API key. Free and Open Source All you need This project focuses on architecture, developer-tools, language-model, llm, system-design, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate swark into their workflows to solve complex technical challenges more efficiently. Check out swark if you're working in this space."
    },
    {
        "id": "databricks_dicer",
        "name": "dicer",
        "github_url": "https://github.com/databricks/dicer",
        "script_text": "dicer is a Scala-based project that dicer auto-sharder infrastructure for building sharded services. Dicer is a foundational infrastructure system for building sharded services. By colocating in-memory state with the computation that operates on it, Dicer enables applications to achieve low latency, high availability, and cost efficiency at scale. It is widely used across Databricks, where it has d Built with Scala, it leverages the language's strengths to deliver robust performance. Developers can integrate dicer into their workflows to solve complex technical challenges more efficiently. Check out dicer if you're working in this space."
    },
    {
        "id": "puckeditor_puck",
        "name": "puck",
        "github_url": "https://github.com/puckeditor/puck",
        "script_text": "puck is a TypeScript-based project that the visual editor for react with ai superpowers. The visual editor for React Puck is a modular, open-source visual editor for React.js. You can use Puck to build custom drag-and-drop experiences with your own application and React components. Because Puck is just a React component, it plays well with all React.js environments, including Next.js. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate puck into their workflows to solve complex technical challenges more efficiently. puck is worth exploring for your next project."
    },
    {
        "id": "bolt_foundry_gambit",
        "name": "gambit",
        "github_url": "https://github.com/bolt-foundry/gambit",
        "script_text": "gambit is a TypeScript-based project that agent harness framework for building, running, and verifying llm workflows. Gambit is an open-source, developer-first framework that helps you build reliable LLM workflows by composing small, typed decks with clear inputs outputs and guardrails. Run decks locally, stream traces, and debug with a built-in UI. Requirements Node.js 18 and OPENROUTER API KEY (set OPENROU Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate gambit into their workflows to solve complex technical challenges more efficiently. Check out gambit if you're working in this space."
    },
    {
        "id": "iofficeai_aionui",
        "name": "AionUi",
        "github_url": "https://github.com/iOfficeAI/AionUi",
        "script_text": "AionUi is a TypeScript-based project that free, local, open-source 24 7 cowork and clawdbot for gemini cli, claude code, codex, opencode, qwen code, goose cli, auggie, and more star if you like it!. What Can AionUi Do? Why Choose AionUi? Core Features Quick Start Community If you have installed command-line tools like Gemini CLI, Claude Code, CodeX, Qwen Code, Goose AI, Augment Code, AionUi can automatically detect them and provide a unified graphical interface Auto Detect This project focuses on acp, ai, ai-agent, assistant, chat, providing developers with specialized tools and capabilities in these areas. Built with TypeScript, it leverages the language's strengths to deliver robust performance. Developers can integrate AionUi into their workflows to create polished user interfaces and interactive components. AionUi is worth exploring for your next project."
    },
    {
        "id": "facebook_github_io",
        "name": "facebook.github.io",
        "github_url": "https://facebook.github.io/memlab",
        "script_text": "facebook.github.io is a Web-based project an open-source tool available on GitHub. This project focuses on website, providing developers with specialized tools and capabilities in these areas. Built with Web, it leverages the language's strengths to deliver robust performance. Developers can integrate facebook.github.io into their workflows to solve complex technical challenges more efficiently. Check out facebook.github.io if you're working in this space."
    }
]